In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt

In [6]:
dfo = pd.read_csv('../data/P87-S8-Time-Series-Resources/all_stocks_5yr.csv', parse_dates=['date'])
dfo.head()

        date   open   high    low  close    volume Name
0 2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1 2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2 2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3 2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4 2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL

In [7]:
dfo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 619040 entries, 0 to 619039
Data columns (total 7 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    619040 non-null  datetime64[ns]
 1   open    619029 non-null  float64
 2   high    619032 non-null  float64
 3   low     619032 non-null  float64
 4   close   619040 non-null  float64
 5   volume  619040 non-null  int64
 6   Name    619040 non-null  object
dtypes: datetime64[ns](1), float64(4), int64(1), object(1)
memory usage: 33.1+ MB

In [9]:
dfo.dropna(inplace=True)

In [22]:
df_t = df.set_index(['date','Name'])
df_t.sort_index(inplace=True)
df_t.head()

                    open     high      low    close     volume
date       Name
2013-02-08 A     45.0700  45.3500  45.0000  45.0800    1824755
           AAL   15.0700  15.1200  14.6300  14.7500    8407500
           AAP   78.3400  79.7200  78.0100  78.9000    1298137
           AAPL  67.7142  68.4014  66.8928  67.8542  158168416
           ABBV  36.3700  36.4200  35.8250  36.2500   13858795